src/cf/DataProcessors/обм_Дашборд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>обм_Дашборд</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/обм_КОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>обм_КОтправке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагОшибкиОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ИсходящиеСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/обм_ВходящиеСообщения_Статусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>обм_ВходящиеСообщения_Статусы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.обм_ВходящиеСообщения_Статусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнийПриемник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ВходящиеСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/обм_ВходящиеСообщения_Статусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>обм_ВходящиеСообщения_Статусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖдетОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанСОшибкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбрабатывается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/обм_Дашборд/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Сводка очередей, регламентных заданий, ссылок и ошибок журнала за сегодня.
// Вызов снаружи: Обработки.обм_Дашборд.Сводка().
//
// Возвращаемое значение:
//  Структура - ключи Очереди, Регламентные, Ссылки, Ошибки
Функция Сводка() Экспорт

	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off

	очереди = Новый Массив;
	очереди.Добавить(ОчередьОписание("Измененные", Метаданные.РегистрыСведений.обм_Измененные));
	очереди.Добавить(ОчередьОписание("КОтправке", Метаданные.РегистрыСведений.обм_КОтправке));
	очереди.Добавить(ОчередьОписание("Входящие", Метаданные.Справочники.обм_ВходящиеСообщения));
	очереди.Добавить(ОчередьОписание("ПакетыДанных", Метаданные.Справочники.обм_ПакетыДанных));

	регламентные = Новый Массив;
	Для Каждого метаЗадания Из МетаданныеРегламентныхЗаданий() Цикл
		регламентные.Добавить(РегламентноеОписание(метаЗадания));

	КонецЦикла;
	метаЗадания = Неопределено;

	ссылки = Новый Массив;
	ссылки.Добавить(СсылкаОписание("Настройки", Метаданные.Справочники.обм_Настройки));
	ссылки.Добавить(СсылкаОписание("Обработчики", Метаданные.Справочники.общ_Обработчики));
	ссылки.Добавить(СсылкаОписание("Исходящие", Метаданные.Справочники.обм_ИсходящиеСообщения));
	ссылки.Добавить(СсылкаОписание("Отправленные", Метаданные.РегистрыСведений.обм_ОтправленныеСообщения));

	ошибки = Журнал_ОшибкиЗаСегодня();

	результат = Новый Структура;
	результат.Вставить("Очереди", очереди);
	результат.Вставить("Регламентные", регламентные);
	результат.Вставить("Ссылки", ссылки);
	результат.Вставить("Ошибки", ошибки);

	УстановитьПривилегированныйРежим(Ложь);

	Возврат результат;

КонецФункции

// Возвращает остаток и ошибки очереди обмена по ключу.
//
// Параметры:
//  пКлючОчереди - Строка - Измененные, КОтправке, Входящие, ПакетыДанных
//
// Возвращаемое значение:
//  Структура - ключи Остаток, Ошибки (Число)
Функция Очередь_Состояние(пКлючОчереди) Экспорт

	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off

	результат = Очередь_СостояниеПустое();
	Если пКлючОчереди = "Измененные" Тогда
		результат = Очередь_СостояниеИзмененные();

	ИначеЕсли пКлючОчереди = "КОтправке" Тогда
		результат = Очередь_СостояниеКОтправке();

	ИначеЕсли пКлючОчереди = "Входящие" Тогда
		результат = Очередь_СостояниеВходящие();

	ИначеЕсли пКлючОчереди = "ПакетыДанных" Тогда
		результат = Очередь_СостояниеПакетыДанных();

	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат результат;

КонецФункции

// Текст счётчика очереди: остаток и суффикс ошибок, если они есть.
//
// Параметры:
//  пОстаток - Число - остаток очереди
//  пОшибки - Число - ошибки очереди
//
// Возвращаемое значение:
//  Строка - "N" или "N, ошибок M"
Функция Очередь_ТекстСчётчика(пОстаток, пОшибки) Экспорт

	текстОстатка = Формат(пОстаток, "ЧН=0; ЧГ=0");
	Если пОшибки > 0 Тогда
		Возврат СтрШаблон("%1, ошибок %2", текстОстатка, Формат(пОшибки, "ЧН=0; ЧГ=0"));

	КонецЕсли;

	Возврат текстОстатка;

КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция МетаданныеРегламентныхЗаданий()

	результат = Новый Массив;
	результат.Добавить(Метаданные.РегламентныеЗадания.обм_Отправка_1_ИсходящиеСообщения_Создать);
	результат.Добавить(Метаданные.РегламентныеЗадания.обм_Отправка_2_ИсходящиеСообщения_Отправить);
	результат.Добавить(Метаданные.РегламентныеЗадания.обм_Получение_1_ПакетыДанных_Извлечь);
	результат.Добавить(Метаданные.РегламентныеЗадания.обм_Получение_2_ПакетыДанных_Обработать);
	результат.Добавить(Метаданные.РегламентныеЗадания.обм_Очистка_ВходящиеСообщения);
	результат.Добавить(Метаданные.РегламентныеЗадания.обм_Очистка_ИсходящиеСообщения);

	Возврат результат;

КонецФункции

Функция ОчередьОписание(пКлюч, пМетаданныеОбъекта)

	описание = Новый Структура;
	состояние = Очередь_Состояние(пКлюч);
	описание.Вставить("Ключ", пКлюч);
	описание.Вставить("Синоним", пМетаданныеОбъекта.Синоним);
	описание.Вставить("Остаток", состояние.Остаток);
	описание.Вставить("Ошибки", состояние.Ошибки);
	описание.Вставить("ИмяФормыСписка", ИмяФормыСписка(пМетаданныеОбъекта));

	Возврат описание;

КонецФункции

Функция РегламентноеОписание(пМетаЗадания)

	описание = Новый Структура;
	описание.Вставить("Имя", пМетаЗадания.Имя);
	описание.Вставить("Синоним", пМетаЗадания.Синоним);
	описание.Вставить("Использование", Обработки.обм_Дашборд.Регламентное_Использование(пМетаЗадания.Имя));

	Возврат описание;

КонецФункции

Функция СсылкаОписание(пКлюч, пМетаданныеОбъекта)

	описание = Новый Структура;
	описание.Вставить("Ключ", пКлюч);
	описание.Вставить("Заголовок", пМетаданныеОбъекта.Синоним);
	описание.Вставить("ИмяФормы", ИмяФормыСписка(пМетаданныеОбъекта));

	Возврат описание;

КонецФункции

Функция ИмяФормыСписка(пМетаданныеОбъекта)

	формаСписка = пМетаданныеОбъекта.Формы.Найти("ФормаСписка");
	Если формаСписка = Неопределено Тогда
		Возврат пМетаданныеОбъекта.ПолноеИмя() + ".ФормаСписка";

	КонецЕсли;

	Возврат формаСписка.ПолноеИмя();

КонецФункции

Функция Очередь_СостояниеПустое()

	результат = Новый Структура;
	результат.Вставить("Остаток", 0);
	результат.Вставить("Ошибки", 0);

	Возврат результат;

КонецФункции

Функция Очередь_СостояниеИзВыборки(пВыборка)

	результат = Очередь_СостояниеПустое();
	Если пВыборка.Следующий() Тогда
		результат.Остаток = пВыборка.Остаток;
		результат.Ошибки = пВыборка.Ошибки;

	КонецЕсли;

	Возврат результат;

КонецФункции

Функция Очередь_СостояниеИзмененные()

	запрос = Новый Запрос;
	запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|		КОГДА Очередь.ФлагОшибкиПриОбработке
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ), 0) КАК Остаток,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|		КОГДА Очередь.ФлагОшибкиПриОбработке
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ), 0) КАК Ошибки
	|ИЗ
	|	РегистрСведений.обм_Измененные КАК Очередь";

	Возврат Очередь_СостояниеИзВыборки(запрос.Выполнить().Выбрать());

КонецФункции

Функция Очередь_СостояниеКОтправке()

	запрос = Новый Запрос;
	запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(*), 0) КАК Остаток,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|		КОГДА Очередь.ФлагОшибкиОтправки
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ), 0) КАК Ошибки
	|ИЗ
	|	РегистрСведений.обм_КОтправке КАК Очередь";

	Возврат Очередь_СостояниеИзВыборки(запрос.Выполнить().Выбрать());

КонецФункции

Функция Очередь_СостояниеВходящие()

	запрос = Новый Запрос;
	// срез без параметров: все последние статусы, как Получение_ОбработатьОчередь
	// BSLLS:VirtualTableCallWithoutParameters-off
	запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|		КОГДА Статусы.Статус В (
	|			ЗНАЧЕНИЕ(Перечисление.обм_ВходящиеСообщения_Статусы.Получен),
	|			ЗНАЧЕНИЕ(Перечисление.обм_ВходящиеСообщения_Статусы.ЖдетОбработки))
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ), 0) КАК Остаток,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|		КОГДА Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.обм_ВходящиеСообщения_Статусы.ОбработанСОшибкой)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ), 0) КАК Ошибки
	|ИЗ
	|	РегистрСведений.обм_ВходящиеСообщения_Статусы.СрезПоследних КАК Статусы
	|ГДЕ
	|	НЕ Статусы.ВходящееСообщение.ПометкаУдаления";
	// BSLLS:VirtualTableCallWithoutParameters-on

	Возврат Очередь_СостояниеИзВыборки(запрос.Выполнить().Выбрать());

КонецФункции

Функция Очередь_СостояниеПакетыДанных()

	запрос = Новый Запрос;
	// срез во временную таблицу, затем соединение со справочником
	// BSLLS:VirtualTableCallWithoutParameters-off
	запрос.Текст =
	"ВЫБРАТЬ
	|	Статусы.ВходящееСообщение КАК ВходящееСообщение,
	|	Статусы.Статус КАК Статус
	|ПОМЕСТИТЬ втСтатусыВходящих
	|ИЗ
	|	РегистрСведений.обм_ВходящиеСообщения_Статусы.СрезПоследних КАК Статусы
	|ГДЕ
	|	Статусы.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.обм_ВходящиеСообщения_Статусы.ЖдетОбработки),
	|		ЗНАЧЕНИЕ(Перечисление.обм_ВходящиеСообщения_Статусы.ОбработанСОшибкой))
	|	И НЕ Статусы.ВходящееСообщение.ПометкаУдаления
	|;
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|		КОГДА втСтатусыВходящих.Статус = ЗНАЧЕНИЕ(Перечисление.обм_ВходящиеСообщения_Статусы.ЖдетОбработки)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ), 0) КАК Остаток,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|		КОГДА втСтатусыВходящих.Статус = ЗНАЧЕНИЕ(Перечисление.обм_ВходящиеСообщения_Статусы.ОбработанСОшибкой)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ), 0) КАК Ошибки
	|ИЗ
	|	Справочник.обм_ПакетыДанных КАК Пакеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтатусыВходящих КАК втСтатусыВходящих
	|		ПО Пакеты.Владелец = втСтатусыВходящих.ВходящееСообщение
	|ГДЕ
	|	НЕ Пакеты.ПометкаУдаления";
	// BSLLS:VirtualTableCallWithoutParameters-on

	Возврат Очередь_СостояниеИзВыборки(запрос.Выполнить().Выбрать());

КонецФункции

Функция Журнал_ОшибкиЗаСегодня()

	датаНачала = НачалоДня(ТекущаяДатаСеанса());
	датаОкончания = КонецДня(датаНачала);
	// корень ИмяСобытияЖурналаРегистрации; пустой аргумент даёт «обм.»
	событиеОбм = "обм";

	результат = Новый Массив;
	результат.Добавить(ОшибкаОписание(
		"Всего",
		"Ошибки за сегодня",
		Журнал_КоличествоОшибок(датаНачала, датаОкончания, ""),
		датаНачала,
		""));
	результат.Добавить(ОшибкаОписание(
		"обм",
		"Ошибки обм_ за сегодня",
		Журнал_КоличествоОшибок(датаНачала, датаОкончания, событиеОбм),
		датаНачала,
		событиеОбм));

	Возврат результат;

КонецФункции

Функция ОшибкаОписание(пКлюч, пСиноним, пКоличество, пДатаНачала, пСобытие)

	количествоТекст = Формат(пКоличество, "ЧН=0; ЧГ=0");
	Если пКоличество >= 10000 Тогда
		количествоТекст = количествоТекст + "+";

	КонецЕсли;

	описание = Новый Структура;
	описание.Вставить("Ключ", пКлюч);
	описание.Вставить("Заголовок", СтрШаблон("%1: %2", пСиноним, количествоТекст));
	описание.Вставить("ИмяФормы", "Обработка.общ_ЖурналРегистрации.Форма");
	параметрыОткрытия = Новый Структура;
	параметрыОткрытия.Вставить("ДатаНачала", пДатаНачала);
	параметрыОткрытия.Вставить("ДатаОкончания", КонецДня(пДатаНачала));
	параметрыОткрытия.Вставить("ОтбиратьОшибки", Истина);
	Если Не ПустаяСтрока(пСобытие) Тогда
		параметрыОткрытия.Вставить("СобытиеЖурналаРегистрации", пСобытие);

	КонецЕсли;
	описание.Вставить("Параметры", параметрыОткрытия);

	Возврат описание;

КонецФункции

// Количество записей журнала уровня Ошибка за интервал.
//
// Параметры:
//  пДатаНачала - Дата - начало отбора
//  пДатаОкончания - Дата - конец отбора
//  пСобытие - Строка - имя события журнала; пусто - все события
//
// Возвращаемое значение:
//  Число - число записей, не больше 10000
Функция Журнал_КоличествоОшибок(пДатаНачала, пДатаОкончания, пСобытие)

	// ponytail: нет COUNT у журнала; ВыгрузитьЖурналРегистрации. Потолок 10000, иначе дашборд встанет.
	отбор = Новый Структура;
	отбор.Вставить("ДатаНачала", пДатаНачала);
	отбор.Вставить("ДатаОкончания", пДатаОкончания);
	отбор.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
	Если Не ПустаяСтрока(пСобытие) Тогда
		отбор.Вставить("Событие", пСобытие);

	КонецЕсли;

	таблица = Новый ТаблицаЗначений;
	Попытка
		ВыгрузитьЖурналРегистрации(таблица, отбор, "Уровень", , 10000);

	Исключение
		общ.Ошибка_ВЖурналРегистрации(
			обм.ИмяСобытияЖурналаРегистрации("Дашборд"),
			ИнформацияОбОшибке());
		Возврат 0;

	КонецПопытки;

	Возврат таблица.Количество();

КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
